import sys

before = [2, 5, 6, 9, 7]
after =  [3, 4, 4, 6, 5]


def check_n(n1, n2):
    '''
    Checks for the number of items in each selection.
    -------------------------------------------------
    Проверяет количество элементов в каждой выборке.
    '''
    if(n1 != n2):
        sys.exit("The size of the first sample is not equal to the size of the second!")
    if(n1 < 4):
        sys.exit("The samples are too small!")
    if(n1 > 300):
        sys.exit("Too large a sample n must be < 301 !")


def g_table(n):
    tbl005 =   [0, 0, 0, 1, 1, 1,
    2, 2, 3, 3, 3, 4, 4, 5, 5, 5,
    6, 6, 7, 7, 7, 8, 8, 8, 9, 10,
    10, 10, 11, 11, 12, 12, 13, 13, 13, 14,
    14, 15, 15, 16, 16, 16, 17, 17, 18, 18,
    18, 19, 19, 20, 20, 21, 21, 22, 22, 23,
    23, 24, 24, 24, 24, 25, 25, 26, 26, 27,
    27, 28, 28, 29, 29, 30, 30, 31, 31, 32,
    32, 33, 33, 33, 33, 34, 34, 35, 35, 36,
    36, 37, 37, 38, 38, 39, 39, 40, 40, 41,
    41, 41, 41, 41, 41, 41, 41, 41, 41, 45,
    45, 45, 45, 45, 45, 45, 45, 45, 45, 50,
    50, 50, 50, 50, 50, 50, 50, 50, 50, 55,
    55, 55, 55, 55, 55, 55, 55, 55, 55, 59,
    59, 59, 59, 59, 59, 59, 59, 59, 59, 64,
    64, 64, 64, 64, 64, 64, 64, 64, 64, 69,
    69, 69, 69, 69, 69, 69, 69, 69, 69, 73,
    73, 73, 73, 73, 73, 73, 73, 73, 73, 78,
    78, 78, 78, 78, 78, 78, 78, 78, 78, 83,
    83, 83, 83, 83, 83, 83, 83, 83, 83, 87,
    87, 87, 87, 87, 87, 87, 87, 87, 87, 87,
    87, 87, 87, 87, 87, 87, 87, 87, 87, 97,
    97, 97, 97, 97, 97, 97, 97, 97, 97, 97,
    97, 97, 97, 97, 97, 97, 97, 97, 97, 106,
    106, 106, 106, 106, 106, 106, 106, 106, 106, 106,
    106, 106, 106, 106, 106, 106, 106, 106, 106, 116,
    116, 116, 116, 116, 116, 116, 116, 116, 116, 116,
    116, 116, 116, 116, 116, 116, 116, 116, 116, 125,
    125, 125, 125, 125, 125, 125, 125, 125, 125, 125,
    125, 125, 125, 125, 125, 125, 125, 125, 125, 135]

    tbl001 =    [float('nan'), float('nan'), 0, 0, 0, 0,
           1, 1, 1, 2, 2, 2, 3, 3, 4, 4,
           4, 5, 5, 5, 6, 6, 7, 7, 7, 8,
           8, 8, 9, 9, 10, 10, 10, 11, 11, 12,
           12, 13, 13, 13, 14, 14, 15, 15, 15, 16,
           17, 17, 18, 18, 18, 18, 19, 19, 20, 20,
           21, 21, 22, 22, 23, 23, 23, 23, 24, 24,
           25, 25, 26, 26, 27, 27, 28, 28, 29, 29,
           30, 30, 30, 30, 31, 31, 32, 32, 33, 33,
           34, 34, 35, 35, 36, 36, 37, 37, 37, 37,
           37, 37, 37, 37, 37, 37, 37, 37, 37, 42,
           42, 42, 42, 42, 42, 42, 42, 42, 42, 46,
           46, 46, 46, 46, 46, 46, 46, 46, 46, 51,
           51, 51, 51, 51, 51, 51, 51, 51, 51, 55,
           55, 55, 55, 55, 55, 55, 55, 55, 55, 60,
           60, 60, 60, 60, 60, 60, 60, 60, 60, 64,
           64, 64, 64, 64, 64, 64, 64, 64, 64, 69,
           69, 69, 69, 69, 69, 69, 69, 69, 69, 73,
           73, 73, 73, 73, 73, 73, 73, 73, 73, 78,
           78, 78, 78, 78, 78, 78, 78, 78, 78, 83,
           83, 83, 83, 83, 83, 83, 83, 83, 83, 83,
           83, 83, 83, 83, 83, 83, 83, 83, 83, 92,
           92, 92, 92, 92, 92, 92, 92, 92, 92, 92,
           92, 92, 92, 92, 92, 92, 92, 92, 92, 101,
           101, 101, 101, 101, 101, 101, 101, 101, 101, 101,
           101, 101, 101, 101, 101, 101, 101, 101, 101, 110,
           110, 110, 110, 110, 110, 110, 110, 110, 110, 110,
           110, 110, 110, 110, 110, 110, 110, 110, 110, 120,
           120, 120, 120, 120, 120, 120, 120, 120, 120, 120,
           120, 120, 120, 120, 120, 120, 120, 120, 120, 129]

    g005 = tbl005[n - 5]
    g001 = tbl001[n - 5]

    return g005, g001


def g_shift(bef, aft):
    '''
    Hypotheses:
        H0: The predominance of the typical shift direction is not significant
        H1: The predominance of the typical shift direction is significant
    -----------------------------------------
    Гипотезы:
        H0: Преобладание типичного направления сдвига не является значимым
        H1: Преобладание типичного направления сдвига является значимым
    '''
    check_n(len(bef), len(aft))

    shift = []
    temp = 0
    for i in range(len(bef)):                       # Step 1.
        shift.append(aft[i - temp] - bef[i - temp]) # Сalculate the shifts

        if shift[i - temp] == 0:                    # Step 2.
            shift.pop(i - temp)                     # Exclude zero shifts
            aft.pop(i - temp)                       # ------------------------
            bef.pop(i - temp)                       # Исключить нулевые сдвиги
            temp += 1                               #

    if(len(shift) < 5):
        sys.exit("After excluding zero reactions, the number of observations does not meet the restrictions. There is no way to continue the test.\nПосле исключения нулевых реакций, количество наблюдений не удовлетворяет ограничениям. Нет возможности продолжить тест.")

    plus = minus = 0
    for i in range(len(shift)):         # Step 3.
        if shift[i] < abs(shift[i]):    # Determine the prevailing shifts(typical)
            minus += 1                  # -----------------------------------------
        else:                           # Определить преобладающие сдвиги(типичные)
            plus += 1                   #

    if plus > minus:
        g = plus
    else:
        g = minus

    g005, g001 = g_table(len(shift))

    print(f'\ng = {g}, g_005 = {g005}, g_001 = {g001}\n')
    if(g > g005):
        print('g > g_005 there is no reason to reject Ho with a confidence level of 95%. The shift in the typical direction is not significant\n')
        if(g > g001):
            print('g > g_001 there is no reason to reject Ho with a confidence level of 99%. The shift in the typical direction is not significant\n')
    else:
        print('g < g_table. H1. The shift in the typical direction is significant \n')

g_shift(before, after)
